Revit 2027 API
AssemblyInstance.NamingCategoryId Property
 Id of the category that drives the default naming scheme for the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NamingCategoryId { get; set; }
Public Property NamingCategoryId As ElementId
	Get
	Set
public:
property ElementId^ NamingCategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member NamingCategoryId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: This naming category was not valid for an assembly instance containing the proposed members. The naming category should match one of the member element categories.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace